mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC1000_DFP.2.11.0.pdsc
      <!-- ******************************  XMC1100-T016x0008  ****************************** -->
      <device Dname="XMC1100-T016x0008">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1100_series/Include/XMC1100.h"  define="XMC1100_T016x0008"/>
        <debug      svd="SVD/XMC1100.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x2000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1100_64.FLM"     start="0x10001000"  size="0x10000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1100-AB_rm-UM-v01_03-EN.pdf"   title="XMC1100 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1100_AB-DS-v01_08-EN.pdf"      title="XMC1100 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1100_AB-ES-v01_04-EN.pdf"      title="XMC1100 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="11"/>
        <feature type="SOP"           n="16"/>       
      </device>

      <!-- ******************************  XMC1100-Q024x0016  ****************************** -->
      <device Dname="XMC1100-Q024x0016">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1100_series/Include/XMC1100.h"  define="XMC1100_Q024x0016"/>
        <debug      svd="SVD/XMC1100.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1100_64.FLM"     start="0x10001000"  size="0x10000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1100-AB_rm-UM-v01_03-EN.pdf"   title="XMC1100 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1100_AB-DS-v01_08-EN.pdf"      title="XMC1100 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1100_AB-ES-v01_04-EN.pdf"      title="XMC1100 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="18"/>
        <feature type="QFN"           n="24"/>
      </device>

      <!-- ******************************  XMC1100-Q040x0016  ****************************** -->
      <device Dname="XMC1100-Q040x0016">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1100_series/Include/XMC1100.h"  define="XMC1100_Q040x0016"/>
        <debug      svd="SVD/XMC1100.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1100_64.FLM"     start="0x10001000"  size="0x10000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1100-AB_rm-UM-v01_03-EN.pdf"   title="XMC1100 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1100_AB-DS-v01_08-EN.pdf"      title="XMC1100 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1100_AB-ES-v01_04-EN.pdf"      title="XMC1100 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="27"/>
        <feature type="QFN"           n="40"/>
      </device>

      <!-- ******************************  XMC1100-T016x0016  ****************************** -->
      <device Dname="XMC1100-T016x0016">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1100_series/Include/XMC1100.h"  define="XMC1100_T016x0016"/>
        <debug      svd="SVD/XMC1100.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1100_64.FLM"     start="0x10001000"  size="0x10000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1100-AB_rm-UM-v01_03-EN.pdf"   title="XMC1100 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1100_AB-DS-v01_08-EN.pdf"      title="XMC1100 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1100_AB-ES-v01_04-EN.pdf"      title="XMC1100 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="11"/>
        <feature type="SOP"           n="16"/>
      </device>

      <!-- ******************************  XMC1100-T038x0016  ****************************** -->
      <device Dname="XMC1100-T038x0016">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1100_series/Include/XMC1100.h"  define="XMC1100_T038x0016"/>
        <debug      svd="SVD/XMC1100.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1100_64.FLM"     start="0x10001000"  size="0x10000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1100-AB_rm-UM-v01_03-EN.pdf"   title="XMC1100 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1100_AB-DS-v01_08-EN.pdf"      title="XMC1100 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1100_AB-ES-v01_04-EN.pdf"      title="XMC1100 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="26"/>
        <feature type="SOP"           n="38"/>
      </device>

      <!-- ******************************  XMC1100-Q024x0032  ****************************** -->
      <device Dname="XMC1100-Q024x0032">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1100_series/Include/XMC1100.h"  define="XMC1100_Q024x0032"/>
        <debug      svd="SVD/XMC1100.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1100_64.FLM"     start="0x10001000"  size="0x10000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1100-AB_rm-UM-v01_03-EN.pdf"   title="XMC1100 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1100_AB-DS-v01_08-EN.pdf"      title="XMC1100 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1100_AB-ES-v01_04-EN.pdf"      title="XMC1100 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="18"/>
        <feature type="QFN"           n="24"/>
      </device>

      <!-- ******************************  XMC1100-Q040x0032  ****************************** -->
      <device Dname="XMC1100-Q040x0032">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1100_series/Include/XMC1100.h"  define="XMC1100_Q040x0032"/>
        <debug      svd="SVD/XMC1100.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1100_64.FLM"     start="0x10001000"  size="0x10000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1100-AB_rm-UM-v01_03-EN.pdf"   title="XMC1100 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1100_AB-DS-v01_08-EN.pdf"      title="XMC1100 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1100_AB-ES-v01_04-EN.pdf"      title="XMC1100 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="27"/>
        <feature type="QFN"           n="40"/>
      </device>

      <!-- ******************************  XMC1100-T016x0032  ****************************** -->
      <device Dname="XMC1100-T016x0032">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1100_series/Include/XMC1100.h"  define="XMC1100_T016x0032"/>
        <debug      svd="SVD/XMC1100.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1100_64.FLM"     start="0x10001000"  size="0x10000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1100-AB_rm-UM-v01_03-EN.pdf"   title="XMC1100 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1100_AB-DS-v01_08-EN.pdf"      title="XMC1100 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1100_AB-ES-v01_04-EN.pdf"      title="XMC1100 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="11"/>
        <feature type="SOP"           n="16"/>
      </device>

      <!-- ******************************  XMC1100-T038x0032  ****************************** -->
      <device Dname="XMC1100-T038x0032">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1100_series/Include/XMC1100.h"  define="XMC1100_T038x0032"/>
        <debug      svd="SVD/XMC1100.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1100_64.FLM"     start="0x10001000"  size="0x10000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1100-AB_rm-UM-v01_03-EN.pdf"   title="XMC1100 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1100_AB-DS-v01_08-EN.pdf"      title="XMC1100 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1100_AB-ES-v01_04-EN.pdf"      title="XMC1100 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="26"/>
        <feature type="SOP"           n="38"/>
      </device>

