mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC1000_DFP.2.11.0.pdsc
      <!-- ******************************  XMC1202-T016x0032  ****************************** -->
      <device Dname="XMC1202-T016x0032">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1200_series/Include/XMC1200.h"  define="XMC1202_T016x0032"/>
        <debug      svd="SVD/XMC1200.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1200_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1200-AB_rm-UM-v01_03-EN.pdf"   title="XMC1200 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1200_AB-DS-v01_08-EN.pdf"      title="XMC1200 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1200_AB-ES-v01_04-EN.pdf"      title="XMC1200 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="11"/>
        <feature type="SOP"           n="16"/>  
      </device>

      <!-- ******************************  XMC1202-T028x0032  ****************************** -->
      <device Dname="XMC1202-T028x0032">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1200_series/Include/XMC1200.h"  define="XMC1202_T028x0032"/>
        <debug      svd="SVD/XMC1200.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1200_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1200-AB_rm-UM-v01_03-EN.pdf"   title="XMC1200 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1200_AB-DS-v01_08-EN.pdf"      title="XMC1200 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1200_AB-ES-v01_04-EN.pdf"      title="XMC1200 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="20"/>
        <feature type="SOP"           n="28"/>  
      </device>
      
      <!-- ******************************  XMC1202-T028x0064  ****************************** -->
      <device Dname="XMC1202-T028x0064">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1200_series/Include/XMC1200.h"  define="XMC1202_T028x0064"/>
        <debug      svd="SVD/XMC1200.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1200_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1200-AB_rm-UM-v01_03-EN.pdf"   title="XMC1200 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1200_AB-DS-v01_08-EN.pdf"      title="XMC1200 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1200_AB-ES-v01_04-EN.pdf"      title="XMC1200 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="20"/>
        <feature type="SOP"           n="28"/>  
      </device>   

      <!-- ******************************  XMC1202-T016x0064  ****************************** -->
      <device Dname="XMC1202-T016x0064">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1200_series/Include/XMC1200.h"  define="XMC1202_T016x0064"/>
        <debug      svd="SVD/XMC1200.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1200_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1200-AB_rm-UM-v01_03-EN.pdf"   title="XMC1200 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1200_AB-DS-v01_08-EN.pdf"      title="XMC1200 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1200_AB-ES-v01_04-EN.pdf"      title="XMC1200 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="SOP"           n="16"/>  
        <feature type="IOs"           n="11"/>
      </device>   
      </subFamily>

      <!-- ************************  Subfamily 'XMC1300'  **************************** -->
      <subFamily DsubFamily="XMC1300 Series">
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="ComOther"      n="2"                         name="Universal Serial Interface channels (configurable as SPI, UART, IIC, IIS)"/>
              
      <!-- ******************************  XMC1301-Q024x0008  ****************************** -->
      <device Dname="XMC1301-Q024x0008">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1301_Q024x0008"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x2000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_03-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v02_00-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_04-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="18"/>
        <feature type="QFN"           n="24"/>  
      </device>

      <!-- ******************************  XMC1301-Q040x0008  ****************************** -->
      <device Dname="XMC1301-Q040x0008">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1301_Q040x0008"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x2000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_03-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v02_00-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_04-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="27"/>
        <feature type="QFN"           n="40"/>  
      </device>

      <!-- ******************************  XMC1301-T016x0008  ****************************** -->
      <device Dname="XMC1301-T016x0008">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1301_T016x0008"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x2000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_03-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v02_00-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_04-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="11"/>
        <feature type="SOP"           n="16"/>  
      </device>

      <!-- ******************************  XMC1301-T038x0008  ****************************** -->
      <device Dname="XMC1301-T038x0008">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1301_T038x0008"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x2000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_03-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v02_00-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_04-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="26"/>
        <feature type="SOP"           n="38"/>  
      </device>

      <!-- ******************************  XMC1301-Q024x0016  ****************************** -->
      <device Dname="XMC1301-Q024x0016">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1301_Q024x0016"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_03-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v02_00-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_04-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="18"/>
        <feature type="QFN"           n="24"/>  
      </device>

      <!-- ******************************  XMC1301-Q040x0016  ****************************** -->
      <device Dname="XMC1301-Q040x0016">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1301_Q040x0016"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_03-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v02_00-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_04-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="27"/>
        <feature type="QFN"           n="40"/>  
      </device>

      <!-- ******************************  XMC1301-T016x0016  ****************************** -->
      <device Dname="XMC1301-T016x0016">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1301_T016x0016"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_03-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v02_00-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_04-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="11"/>
        <feature type="SOP"           n="16"/>  
      </device>

      <!-- ******************************  XMC1301-T038x0016  ****************************** -->
      <device Dname="XMC1301-T038x0016">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1301_T038x0016"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_03-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v02_00-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_04-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="26"/>
        <feature type="SOP"           n="38"/>  
      </device>

      <!-- ******************************  XMC1301-Q040x0032  ****************************** -->
      <device Dname="XMC1301-Q040x0032">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1301_Q040x0032"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_03-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v02_00-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_04-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="27"/>
        <feature type="QFN"           n="40"/>  
      </device>

      <!-- ******************************  XMC1301-T038x0032  ****************************** -->
      <device Dname="XMC1301-T038x0032">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1301_T038x0032"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_03-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v02_00-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_04-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="26"/>
        <feature type="SOP"           n="38"/>  
      </device>

