mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC1000_DFP.2.11.0.pdsc
      <!-- ******************************  XMC1302-Q024x0032  ****************************** -->
      <device Dname="XMC1302-Q024x0032">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1302_Q024x0032"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_03-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v02_00-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_04-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="18"/>
        <feature type="QFN"           n="24"/>        
      </device>

      <!-- ******************************  XMC1302-Q040x0032  ****************************** -->
      <device Dname="XMC1302-Q040x0032">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1302_Q040x0032"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_03-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v02_00-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_04-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="27"/>
        <feature type="QFN"           n="40"/>        
      </device>

      <!-- ******************************  XMC1302-T016x0032  ****************************** -->
      <device Dname="XMC1302-T016x0032">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1302_T016x0032"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_03-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v02_00-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_04-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="11"/>
        <feature type="SOP"           n="16"/>        
      </device>

      <!-- ******************************  XMC1302-T038x0032  ****************************** -->
      <device Dname="XMC1302-T038x0032">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1302_T038x0032"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_03-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v02_00-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_04-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="26"/>
        <feature type="SOP"           n="38"/>        
      </device>

      <!-- ******************************  XMC1302-Q024x0064  ****************************** -->
      <device Dname="XMC1302-Q024x0064">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1302_Q024x0064"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_03-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v02_00-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_04-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="18"/>
        <feature type="QFN"           n="24"/>        
      </device>

      <!-- ******************************  XMC1302-Q040x0064  ****************************** -->
      <device Dname="XMC1302-Q040x0064">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1302_Q040x0064"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_03-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v02_00-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_04-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="27"/>
        <feature type="QFN"           n="40"/>        
      </device>
      
      <!-- ******************************  XMC1301-T038x0064  ****************************** -->
      <device Dname="XMC1301-T038x0064">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1301_T038x0064"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_03-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v02_00-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_04-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="26"/>
        <feature type="SOP"           n="38"/>        
      </device>
      
      <!-- ******************************  XMC1302-T038x0064  ****************************** -->
      <device Dname="XMC1302-T038x0064">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1302_T038x0064"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_03-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v02_00-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_04-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="26"/>
        <feature type="SOP"           n="38"/>        
      </device>

      <!-- ******************************  XMC1302-Q040x0128  ****************************** -->
      <device Dname="XMC1302-Q040x0128">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1302_Q040x0128"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_03-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v02_00-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_04-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="27"/>
        <feature type="QFN"           n="40"/>        
      </device>

      <!-- ******************************  XMC1302-T038x0128  ****************************** -->
      <device Dname="XMC1302-T038x0128">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1302_T038x0128"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_03-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v02_00-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_04-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="26"/>
        <feature type="SOP"           n="38"/>        
      </device>
      
            
      <!-- ******************************  XMC1302-T038x0200  ****************************** -->
      <device Dname="XMC1302-T038x0200">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1302_T038x0200"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x32000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_03-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v02_00-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_04-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="26"/>
        <feature type="SOP"           n="38"/>        
      </device>

      <!-- ******************************  XMC1302-Q040x0200  ****************************** -->
      <device Dname="XMC1302-Q040x0200">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1302_Q040x0200"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x32000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_03-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v02_00-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_04-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Documents/Infineon-XMC1000_Datasheet_Addendum-DS-v01_00-EN.pdf"      title="XMC1000 Datasheet Addendum"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="27"/>
        <feature type="QFN"           n="40"/>        
      </device>

      </subFamily> 
      <!-- ************************  Subfamily 'XMC1400'  **************************** -->
      <subFamily DsubFamily="XMC1400 Series">
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="Timer"         n="8"       m="16"/>      
        <feature type="ComOther"      n="4"                         name="Universal Serial Interface channels (configurable as SPI, UART, IIC, IIS)"/>
              
      <!-- ******************************  XMC1401-Q048x0064   ****************************** -->
      <device Dname="XMC1401-Q048x0064">
        <processor Dclock="48000000"/>
        <compile header="Device/XMC1400_series/Include/XMC1400.h"  define="XMC1401_Q048x0064"/>
        <debug      svd="SVD/XMC1400.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1400_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-XMC1400-AA_ReferenceManual-UM-v01_01-EN.pdf" title="XMC1400 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1400_AA-DS-v01_04-EN.pdf"                    title="XMC1400 Series Data Sheet"/>        
        <book    name="Documents/Infineon-XMC1400_AA-ES-v01_02-EN.pdf"                 title="XMC1400 Series Errata Sheet"/>
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"                          title="XMC1 Peripheral Library"/>  
        <feature type="QFN"           n="48"/>
        <feature type="IOs"           n="34"/>                
      </device> 

      <!-- ******************************  XMC1401-Q048x0128   ****************************** -->
      <device Dname="XMC1401-Q048x0128">
        <processor Dclock="48000000"/>
        <compile header="Device/XMC1400_series/Include/XMC1400.h"  define="XMC1401_Q048x0128"/>
        <debug      svd="SVD/XMC1400.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1400_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-XMC1400-AA_ReferenceManual-UM-v01_01-EN.pdf" title="XMC1400 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1400_AA-DS-v01_04-EN.pdf"                    title="XMC1400 Series Data Sheet"/>        
        <book    name="Documents/Infineon-XMC1400_AA-ES-v01_02-EN.pdf"                 title="XMC1400 Series Errata Sheet"/>
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"                          title="XMC1 Peripheral Library"/>  
        <feature type="QFN"           n="48"/>
        <feature type="IOs"           n="34"/>                
      </device> 

      <!-- ******************************  XMC1401-F064x0064   ****************************** -->
      <device Dname="XMC1401-F064x0064">
        <processor Dclock="48000000"/>
        <compile header="Device/XMC1400_series/Include/XMC1400.h"  define="XMC1401_F064x0064"/>
        <debug      svd="SVD/XMC1400.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1400_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-XMC1400-AA_ReferenceManual-UM-v01_01-EN.pdf" title="XMC1400 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1400_AA-DS-v01_04-EN.pdf"                    title="XMC1400 Series Data Sheet"/>        
        <book    name="Documents/Infineon-XMC1400_AA-ES-v01_02-EN.pdf"                 title="XMC1400 Series Errata Sheet"/>
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"                          title="XMC1 Peripheral Library"/>  
        <feature type="QFP"           n="64"/>
        <feature type="IOs"           n="48"/>        
      </device> 

      <!-- ******************************  XMC1401-F064x00128   ****************************** -->
      <device Dname="XMC1401-F064x0128">
        <processor Dclock="48000000"/>
        <compile header="Device/XMC1400_series/Include/XMC1400.h"  define="XMC1401_F064x0128"/>
        <debug      svd="SVD/XMC1400.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1400_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-XMC1400-AA_ReferenceManual-UM-v01_01-EN.pdf" title="XMC1400 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1400_AA-DS-v01_04-EN.pdf"                    title="XMC1400 Series Data Sheet"/>        
        <book    name="Documents/Infineon-XMC1400_AA-ES-v01_02-EN.pdf"                 title="XMC1400 Series Errata Sheet"/>
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"                          title="XMC1 Peripheral Library"/>  
        <feature type="QFP"           n="64"/>
        <feature type="IOs"           n="48"/>        
      </device> 
      
      <!-- ******************************  XMC1402-T038x0032   ****************************** -->
      <device Dname="XMC1402-T038x0032">
        <processor Dclock="48000000"/>
        <compile header="Device/XMC1400_series/Include/XMC1400.h"  define="XMC1402_T038x0032"/>
        <debug      svd="SVD/XMC1400.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1400_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-XMC1400-AA_ReferenceManual-UM-v01_01-EN.pdf" title="XMC1400 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1400_AA-DS-v01_04-EN.pdf"                    title="XMC1400 Series Data Sheet"/>        
        <book    name="Documents/Infineon-XMC1400_AA-ES-v01_02-EN.pdf"                 title="XMC1400 Series Errata Sheet"/>
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"                          title="XMC1 Peripheral Library"/>  
        <feature type="SOP"           n="38"/>
        <feature type="IOs"           n="26"/>                        
      </device> 

