mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC1000_DFP.2.11.0.pdsc
  <boards>
    <board vendor="Infineon" name="XMC1100 Boot Kit" revision="V1" salesContact="sales@infineon.com" orderForm="http://ehitex.com/evaluation-boards/infineon/456/xmc1100-boot-kit-kit_xmc11_boot_001?c=154">
      <description>Infineon XMC1100 Boot Kit Board Support and Examples</description>
      <image small="Images/XMC1100_small.jpg" large="Images/XMC1100_large.jpg"/>
      <book category="overview"  name="https://www.infineon.com/cms/en/product/evaluation-boards/kit_xmc11_boot_001/" title="XMC1100 Boot Kit Web Page"/>
      <book category="setup"     name="Documents/XMC1100_Boot_Kit_Getting_Started_v1_2.pdf" title="Getting Started"/>
      <book category="schematic" name="Documents/PCB_XMC1100_CPU_Card_V2.zip" title="Schematics"/>
      <book category="manual"    name="Documents/Board_Users_Manual_XMC1100_CPU_Card_R2.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="XMC1100-T038x0064"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="XMC1100 Series"/>
        <feature type="ODbg"      n="1"              name="On-board J-LINK Lite"/>
        <feature type="PWR"       n="5"              name="USB Powered"/>
        <feature type="PWR"       n="3.3" m="5"      name="POWER Connector for external supply"/>
        <feature type="DIO"       n="18"             name="Pins at IOH, 8 pins at IOL (Arduino)"/>
        <feature type="DIO"       n="5"              name="Pins at AUX (non-Arduino)"/>
        <feature type="AIO"       n="6"              name="Analog inputs at AD (Arduino)"/>
        <feature type="AIO"       n="2"              name="Analog inputs at AD_AUX (non-Arduino)"/>
        <feature type="SPI"       n="1"              name="In-Circuit Serial Programming Header"/>
        <feature type="LED"       n="6"              name="User LEDs"/>
        <feature type="ArduinoFF" n="1"/>
      <debugInterface adapter="J-Link" connector="Micro-USB"/>
    </board>

    <board vendor="Infineon" name="XMC1200 Boot Kit" revision="V1" salesContact="sales@infineon.com" orderForm="http://ehitex.com/evaluation-boards/infineon/457/xmc1200-boot-kit-kit_xmc12_boot_001?c=154">
      <description>Infineon XMC1200 Boot Kit Board Support and Examples</description>
      <image small="Images/XMC1200_small.jpg" large="Images/XMC1200_large.jpg"/>
      <book category="overview"  name="https://www.infineon.com/cms/en/product/evaluation-boards/kit_xmc12_boot_001/" title="XMC1200 Boot Kit Web Page"/>
      <book category="setup"     name="Documents/XMC1200_Boot_Kit_Getting_Started_v1_2.pdf" title="Getting Started"/>
      <book category="schematic" name="Documents/PCB_XMC1200_CPU_Card_V2.zip" title="Schematics"/>
      <book category="manual"    name="Documents/Board_Users_Manual_XMC1200_CPU_Card_R2.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="XMC1201-T038x0200"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="XMC1200 Series"/>
        <feature type="ODbg"      n="1"              name="On-board J-LINK Lite"/>
        <feature type="PWR"       n="5"              name="USB Powered"/>
        <feature type="PWR"       n="3.3" m="5"      name="POWER Connector for external supply"/>
        <feature type="DIO"       n="40"             name="Digital IOs: 4 x 10"/>
        <feature type="DIO"       n="60"             name="Digital I/Os through Application Card Connector"/>
        <feature type="Poti"      n="1"/>
        <feature type="LED"       n="5"              name="User LEDs"/>
        <feature type="ArduinoFF" n="1"/>
      <debugInterface adapter="J-Link" connector="Micro-USB"/>
    </board>

    <board vendor="Infineon" name="XMC1300 Boot Kit" revision="V1" salesContact="sales@infineon.com" orderForm="https://www.ehitex.de/en/evaluation-boards/infineon/2499/xmc1300-boot-kit-kit-xmc13-boot-001?c=154">
      <description>Infineon XMC1300 Boot Kit Board Support and Examples</description>
      <image small="Images/XMC1300_small.jpg" large="Images/XMC1300_large.jpg"/>
      <book category="overview"  name="https://www.infineon.com/cms/en/product/evaluation-boards/kit_xmc13_boot_001/" title="XMC1300 Boot Kit Web Page"/>
      <book category="setup"     name="Documents/XMC1300_Boot_Kit_Getting_Started_v1_2.pdf" title="Getting Started"/>
      <book category="schematic" name="Documents/PCB_XMC1300_CPU_Card_V2.zip" title="Schematics"/>
      <book category="manual"    name="Documents/Board_Users_Manual_XMC1300_CPU_Card_R2.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="XMC1302-T038x0200"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="XMC1300 Series"/>
        <feature type="ODbg"      n="1"              name="On-board J-LINK Lite"/>
        <feature type="PWR"       n="5"              name="USB Powered"/>
        <feature type="PWR"       n="3.3" m="5"      name="POWER Connector for external supply"/>
        <feature type="DIO"       n="40"             name="Digital IOs: 4 x 10"/>
        <feature type="DIO"       n="60"             name="Digital I/Os through Application Card Connector"/>
        <feature type="Poti"      n="1"/>
        <feature type="LED"       n="5"              name="User LEDs"/>
        <feature type="ArduinoFF" n="1"/>
      <debugInterface adapter="J-Link" connector="Micro-USB"/>
    </board>
     
    <board vendor="Infineon" name="XMC1400 Boot Kit" revision="V1" salesContact="sales@infineon.com" orderForm="https://www.ehitex.de/en/application-kits/infineon/2600/kit-xmc14-boot-001">
      <description>Infineon XMC1400 Boot Kit Board Support and Examples</description>
      <image small="Images/XMC1400_small.jpg"  large="Images/XMC1400_large.jpg"/>
      <book category="overview"  name="https://www.infineon.com/cms/en/product/evaluation-boards/kit_xmc14_boot_001/" title="XMC1200 Boot Kit Web Page"/>

      <book category="schematic" name="Documents/PCB_XMC1400_CPU_Card_V1.zip" title="Schematics"/>
      <book category="manual"    name="Documents/Infineon-Board_Users_Manual_XMC1400_Boot_Kit.pdf-UM-v01_00-EN.pdf" title="User Manual"/> 
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="XMC1404-Q064x0200"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="XMC1400 Series"/>
        <feature type="ODbg"      n="1"              name="On-board J-LINK Lite"/>
        <feature type="PWR"       n="5"              name="USB Powered"/>
        <feature type="PWR"       n="3.3" m="5"      name="POWER Connector for external supply"/>
        <feature type="DIO"       n="40"             name="Digital IOs: 4 x 10"/>
        <feature type="DIO"       n="60"             name="Digital I/Os through Application Card Connector"/>
        <feature type="Poti"      n="1"/>
        <feature type="LED"       n="5"              name="User LEDs"/>
        <feature type="ArduinoFF" n="1"/>
      <debugInterface adapter="J-Link" connector="Micro-USB"/>
    </board>
      
    <board vendor="Infineon" name="XMC 2Go" revision="V1" salesContact="sales@infineon.com" orderForm="http://ehitex.com/evaluation-boards/infineon/457/xmc-2go">
      <description>Infineon XMC 2Go Board Support and Examples</description>
      <image small="Images/XMC_2Go_small.jpg" large="Images/XMC_2Go_large.jpg"/>
      <book category="overview"  name="https://www.infineon.com/cms/de/product/evaluation-boards/kit_xmc_2go_xmc1100_v1/" title="XMC 2Go Kit Web Page"/>
      <book category="setup"     name="Documents/XMC2Go_Initial-start-up-Guide.pdf" title="Getting Started"/>
      <book category="schematic" name="Documents/PCB_Sources_XMC_2Go_Kit_with_XMC1100-V1.zip" title="Schematics"/>
      <book category="manual"    name="Documents/Board_Users_Manual_XMC_2Go_Kit_with_XMC1100_R1.0.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="XMC1100-Q024x0064"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="XMC1100 Series"/>
        <feature type="ODbg"      n="1"              name="On-board J-LINK Lite"/>
        <feature type="PWR"       n="5"              name="USB Powered"/>
        <feature type="DIO"       n="14"             name="Solder pins"/>
        <feature type="LED"       n="2"              name="User LEDs"/>
        <feature type="CustomFF"  n="14" m="38"/>
      <debugInterface adapter="J-Link" connector="Micro-USB"/>
    </board>

