mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC1000_DFP.2.11.0.pdsc
    <board vendor="Infineon" name="RGB LED Lighting Shield" revision="V1" salesContact="sales@infineon.com" orderForm="https://www.ehitex.de/en/evaluation-boards/infineon/2538/rgb-led-lighting-shield-kit-led-xmc1202-as-01">
      <description>Infineon RGB LED Lighting Shield with XMC1202 Board Support and Examples</description>
      <image small="Images/RGB_LED_Shield_with_XMC1202_small.jpg" large="Images/RGB_LED_Shield_with_XMC1202_large.jpg"/>
      <book category="overview"  name="https://www.infineon.com/cms/en/product/evaluation-boards/kit_led_xmc1202_as_01/" title="RGB LED Lighting Shield Web Page"/>
      <book category="setup"     name="Documents/Infineon-Quick_Start_Guide_RGB_LED_Lighting_Shield_with_XMC1202_for_Arduino.pdf-GS-v01_00-EN.pdf" title="Getting Started"/>
      <book category="schematic" name="Documents/Infineon-RGB_LED_Lighting_Shield-PCB-v02_00-EN.zip" title="Schematics"/>
      <book category="manual"    name="Documents/Infineon-Board_Manual_-_XMC1202_-_RGB_LED_Lighting_Shield_with_XMC1202_for_Arduino_-_v1_0-UM-v01_00-EN.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="XMC1202-T028x0016"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="XMC1100 Series"/>
      <debugInterface adapter="JTAG/SW" connector="10-pin Cortex Debug Connector (0.05 inch connector)"/>
    </board>

  </boards>
  
  <conditions>                                                                
  <!-- conditions are dependency rules that can apply to a component or an individual file -->

    <condition id="XMC1100_T16">                                     
      <description>Infineon XMC1100 series TSSOP16</description>   
      <require Dvendor="Infineon:7" Dname="XMC1100-T016*"/>      
    </condition>    

    <condition id="XMC1100_T38">                                     
      <description>Infineon XMC1100 series TSSOP38</description>   
      <require Dvendor="Infineon:7" Dname="XMC1100-T038*"/>      

    </condition>
    
    <condition id="XMC1100_Q24">                                     
      <description>Infineon XMC1100 series VQFN24</description>   
      <require Dvendor="Infineon:7" Dname="XMC1100-Q024*"/>      
    </condition>        

    <condition id="XMC1100_Q40">                                     
      <description>Infineon XMC1100 series VQFN40</description>   
      <require Dvendor="Infineon:7" Dname="XMC1100-Q040*"/>      
    </condition>
    
    <condition id="XMC11xx ARM">                                     
      <description>Infineon XMC11xx series and Arm Compiler Version 5</description>
      <accept condition="XMC1100_Q24"/>
      <accept condition="XMC1100_Q40"/>
      <accept condition="XMC1100_T16"/>
      <accept condition="XMC1100_T38"/>
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC5"/>      
    </condition> 

    <condition id="XMC11xx ARMCC6">                                     
      <description>Infineon XMC11xx series and Arm Compiler Version 6 (armclang)</description>
      <accept condition="XMC1100_Q24"/>
      <accept condition="XMC1100_Q40"/>
      <accept condition="XMC1100_T16"/>
      <accept condition="XMC1100_T38"/>
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6"/>
    </condition> 

    <condition id="XMC11xx ARMCC6LTO">                                     
      <description>Infineon XMC11xx series and Arm Compiler Version 6 with Link Time Optimization (LTO)</description>
      <accept condition="XMC1100_Q24"/>
      <accept condition="XMC1100_Q40"/>
      <accept condition="XMC1100_T16"/>
      <accept condition="XMC1100_T38"/>
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6LTO"/>
    </condition> 

    <condition id="XMC11xx IAR">                                     
      <description>Infineon XMC11xx series and IAR compiler</description>
      <accept condition="XMC1100_Q24"/>
      <accept condition="XMC1100_Q40"/>
      <accept condition="XMC1100_T16"/>
      <accept condition="XMC1100_T38"/>
      <require Tcompiler="IAR"/>    
    </condition>

    <condition id="XMC11xx GCC">                                     
      <description>Infineon XMC11xx series and GCC compiler</description>
      <accept condition="XMC1100_Q24"/>
      <accept condition="XMC1100_Q40"/>
      <accept condition="XMC1100_T16"/>
      <accept condition="XMC1100_T38"/>
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC11xx_0008_GCC">                                     
      <description>Infineon XMC11xx series and GCC compiler with 8K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC11??-*x0008"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC11xx_0016_GCC">                                     
      <description>Infineon XMC11xx series and GCC compiler with 16K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC11??-*x0016"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC11xx_0032_GCC">                                     
      <description>Infineon XMC11xx series and GCC compiler with 32K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC11??-*x0032"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC11xx_0064_GCC">                                     
      <description>Infineon XMC11xx series and GCC compiler with 64K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC11??-*x0064"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC11xx_0008_ARMCC6">                                     
      <description>Infineon XMC11xx series and GCC compiler with 8K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC11??-*x0008"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6"/>
    </condition>

    <condition id="XMC11xx_0008_ARMCC6LTO">                                     
      <description>Infineon XMC11xx series and GCC compiler with 8K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC11??-*x0008"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6"/>
    </condition>

    <condition id="XMC11xx_0016_ARMCC6">                                     
      <description>Infineon XMC11xx series and GCC compiler with 16K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC11??-*x0016"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6"/>
    </condition>

    <condition id="XMC11xx_0016_ARMCC6LTO">                                     
      <description>Infineon XMC11xx series and GCC compiler with 16K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC11??-*x0016"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6LTO"/>
    </condition>

    <condition id="XMC11xx_0032_ARMCC6">                                     
      <description>Infineon XMC11xx series and GCC compiler with 32K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC11??-*x0032"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6"/>
    </condition>

    <condition id="XMC11xx_0032_ARMCC6LTO">                                     
      <description>Infineon XMC11xx series and GCC compiler with 32K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC11??-*x0032"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6LTO"/>
    </condition>

