mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC1000_DFP.2.11.0.pdsc
    <condition id="XMC11xx_0064_ARMCC6">                                     
      <description>Infineon XMC11xx series and GCC compiler with 64K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC11??-*x0064"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6"/>
    </condition>

    <condition id="XMC11xx_0064_ARMCC6LTO">                                     
      <description>Infineon XMC11xx series and GCC compiler with 64K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC11??-*x0064"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6LTO"/>
    </condition>

    <condition id="XMC11xx">                                     
      <description>Infineon XMC11xx series</description>
      <accept condition="XMC11xx ARM"/>
      <accept condition="XMC11xx ARMCC6"/>
      <accept condition="XMC11xx ARMCC6LTO"/>
      <accept condition="XMC11xx IAR"/>   
      <accept condition="XMC11xx GCC"/>   
    </condition>
  
    <condition id="XMC1200_T38">                                     
      <description>Infineon XMC1200 series TSSOP38</description>   
      <require Dvendor="Infineon:7" Dname="XMC1200-T038*"/>      
    </condition>
    
    <condition id="XMC1201_Q40">                                     
      <description>Infineon XMC1201  series VQFN40</description>   
      <require Dvendor="Infineon:7" Dname="XMC1201-Q040*"/>      
    </condition>    

    <condition id="XMC1201_T28">                                     
      <description>Infineon XMC1201 series TSSOP38</description>   
      <require Dvendor="Infineon:7" Dname="XMC1201-T028*"/>      
    </condition>

    <condition id="XMC1201_T38">                                     
      <description>Infineon XMC1201 series TSSOP38</description>   
      <require Dvendor="Infineon:7" Dname="XMC1201-T038*"/>      
    </condition>
    
    <condition id="XMC1202_Q24">                                     
      <description>Infineon XMC1202 series VQFN24</description>   
      <require Dvendor="Infineon:7" Dname="XMC1202-Q024*"/>      
    </condition>        

    <condition id="XMC1202_Q40">                                     
      <description>Infineon XMC1202 series VQFN40</description>   
      <require Dvendor="Infineon:7" Dname="XMC1202-Q040*"/>      
    </condition>

    <condition id="XMC1202_T16">                                     
      <description>Infineon XMC1202 series TSSOP16</description>   
      <require Dvendor="Infineon:7" Dname="XMC1202-T016*"/>      
    </condition>    

    <condition id="XMC1202_T28">                                     
      <description>Infineon XMC1202 series TSSOP28</description>   
      <require Dvendor="Infineon:7" Dname="XMC1202-T028*"/>      
    </condition>    
    
    <condition id="XMC12xx ARM">                                     
      <description>Infineon XMC12xx series and ARMCC compiler</description>
      <accept condition="XMC1200_T38"/>
      <accept condition="XMC1201_Q40"/>
      <accept condition="XMC1201_T28"/>
      <accept condition="XMC1201_T38"/>
      <accept condition="XMC1202_Q24"/>
      <accept condition="XMC1202_Q40"/>
      <accept condition="XMC1202_T16"/>
      <accept condition="XMC1202_T28"/>
      <require Tcompiler="ARMCC"/>  
      <require Toptions="AC5"/>      
    </condition> 

    <condition id="XMC12xx ARMCC6">                                     
      <description>Infineon XMC12xx series and ARMCC compiler</description>
      <accept condition="XMC1200_T38"/>
      <accept condition="XMC1201_Q40"/>
      <accept condition="XMC1201_T28"/>
      <accept condition="XMC1201_T38"/>
      <accept condition="XMC1202_Q24"/>
      <accept condition="XMC1202_Q40"/>
      <accept condition="XMC1202_T16"/>
      <accept condition="XMC1202_T28"/>
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6"/>
    </condition> 

    <condition id="XMC12xx ARMCC6LTO">                                     
      <description>Infineon XMC12xx series and ARMCC compiler</description>
      <accept condition="XMC1200_T38"/>
      <accept condition="XMC1201_Q40"/>
      <accept condition="XMC1201_T28"/>
      <accept condition="XMC1201_T38"/>
      <accept condition="XMC1202_Q24"/>
      <accept condition="XMC1202_Q40"/>
      <accept condition="XMC1202_T16"/>
      <accept condition="XMC1202_T28"/>
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6LTO"/>
    </condition> 

    <condition id="XMC12xx IAR">                                     
      <description>Infineon XMC12xx series and IAR compiler</description>
      <accept condition="XMC1200_T38"/>
      <accept condition="XMC1201_Q40"/>
      <accept condition="XMC1201_T28"/>
      <accept condition="XMC1201_T38"/>
      <accept condition="XMC1202_Q24"/>
      <accept condition="XMC1202_Q40"/>
      <accept condition="XMC1202_T16"/>
      <accept condition="XMC1202_T28"/>
      <require Tcompiler="IAR"/>    
    </condition> 

    <condition id="XMC12xx GCC">                                     
      <description>Infineon XMC12xx series and GCC compiler</description>
      <accept condition="XMC1200_T38"/>
      <accept condition="XMC1201_Q40"/>
      <accept condition="XMC1201_T28"/>
      <accept condition="XMC1201_T38"/>
      <accept condition="XMC1202_Q24"/>
      <accept condition="XMC1202_Q40"/>
      <accept condition="XMC1202_T16"/>
      <accept condition="XMC1202_T28"/>
      <require Tcompiler="GCC"/>    
    </condition> 

    <condition id="XMC12xx_0016_GCC">                                     
      <description>Infineon XMC11xx series and GCC compiler with 16K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC12??-*x0016"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC12xx_0032_GCC">                                     
      <description>Infineon XMC12xx series and GCC compiler with 32K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC12??-*x0032"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC12xx_0064_GCC">                                     
      <description>Infineon XMC12xx series and GCC compiler with 64K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC12??-*x0064"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC12xx_0128_GCC">                                     
      <description>Infineon XMC12xx series and GCC compiler with 128K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC12??-*x0128"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC12xx_0200_GCC">                                     
      <description>Infineon XMC12xx series and GCC compiler with 200K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC12??-*x0200"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC12xx_0016_ARMCC6">                                     
      <description>Infineon XMC11xx series and GCC compiler with 16K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC12??-*x0016"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6"/>
    </condition>

    <condition id="XMC12xx_0016_ARMCC6LTO">                                     
      <description>Infineon XMC11xx series and GCC compiler with 16K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC12??-*x0016"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6LTO"/>
    </condition>

    <condition id="XMC12xx_0032_ARMCC6">                                     
      <description>Infineon XMC12xx series and GCC compiler with 32K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC12??-*x0032"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6"/>
    </condition>

