mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC1000_DFP.2.11.0.pdsc
    <condition id="XMC12xx_0032_ARMCC6LTO">                                     
      <description>Infineon XMC12xx series and GCC compiler with 32K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC12??-*x0032"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6LTO"/>
    </condition>

    <condition id="XMC12xx_0064_ARMCC6">                                     
      <description>Infineon XMC12xx series and GCC compiler with 64K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC12??-*x0064"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6"/>
    </condition>

    <condition id="XMC12xx_0064_ARMCC6LTO">                                     
      <description>Infineon XMC12xx series and GCC compiler with 64K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC12??-*x0064"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6LTO"/>
    </condition>

    <condition id="XMC12xx_0128_ARMCC6">                                     
      <description>Infineon XMC12xx series and GCC compiler with 128K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC12??-*x0128"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6"/>
    </condition>

    <condition id="XMC12xx_0128_ARMCC6LTO">                                     
      <description>Infineon XMC12xx series and GCC compiler with 128K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC12??-*x0128"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6LTO"/>
    </condition>

    <condition id="XMC12xx_0200_ARMCC6">                                     
      <description>Infineon XMC12xx series and GCC compiler with 200K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC12??-*x0200"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6"/>
    </condition>

    <condition id="XMC12xx_0200_ARMCC6LTO">                                     
      <description>Infineon XMC12xx series and GCC compiler with 200K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC12??-*x0200"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6LTO"/>
    </condition>

    <condition id="XMC12xx">                                     
      <description>Infineon XMC12xx series</description>
      <accept condition="XMC12xx ARM"/>
      <accept condition="XMC12xx ARMCC6"/>
      <accept condition="XMC12xx ARMCC6LTO"/>
      <accept condition="XMC12xx IAR"/>   
      <accept condition="XMC12xx GCC"/>   
    </condition>
  
    <condition id="XMC1301_Q24">                                     
      <description>Infineon XMC1301 series VQFN24</description>   
      <require Dvendor="Infineon:7" Dname="XMC1301-Q024*"/>      
    </condition>    
    
    <condition id="XMC1301_Q40">                                     
      <description>Infineon XMC1201  series VQFN40</description>   
      <require Dvendor="Infineon:7" Dname="XMC1301-Q040*"/>      
    </condition>

    <condition id="XMC1301_T16">                                     
      <description>Infineon XMC1301 series TSSOP16</description>   
      <require Dvendor="Infineon:7" Dname="XMC1301-T016*"/>      
    </condition>    

    <condition id="XMC1301_T38">                                     
      <description>Infineon XMC1301 series TSSOP38</description>   
      <require Dvendor="Infineon:7" Dname="XMC1301-T038*"/>      
    </condition>
    
    <condition id="XMC1302_Q24">                                     
      <description>Infineon XMC1302 series VQFN24</description>   
      <require Dvendor="Infineon:7" Dname="XMC1302-Q024*"/>      
    </condition>        

    <condition id="XMC1302_Q40">                                     
      <description>Infineon XMC1302 series VQFN40</description>   
      <require Dvendor="Infineon:7" Dname="XMC1302-Q040*"/>      
    </condition>

    <condition id="XMC1302_T16">                                     
      <description>Infineon XMC1302 series TSSOP16</description>   
      <require Dvendor="Infineon:7" Dname="XMC1302-T016*"/>      
    </condition>    

    <condition id="XMC1302_T28">                                     
      <description>Infineon XMC1302 series TSSOP28</description>   
      <require Dvendor="Infineon:7" Dname="XMC1302-T028*"/>      
    </condition>

    <condition id="XMC1302_T38">                                     
      <description>Infineon XMC1302 series TSSOP38</description>   
      <require Dvendor="Infineon:7" Dname="XMC1302-T038*"/>      
    </condition>

    <condition id="XMC13xx ARM">                                     
      <description>Infineon XMC13xx series and ARMCC compiler</description>
      <accept condition="XMC1301_Q24"/>
      <accept condition="XMC1301_Q40"/>
      <accept condition="XMC1301_T16"/>
      <accept condition="XMC1301_T38"/>
      <accept condition="XMC1302_Q24"/>
      <accept condition="XMC1302_Q40"/>
      <accept condition="XMC1302_T16"/>
      <accept condition="XMC1302_T28"/>
      <accept condition="XMC1302_T38"/>
      <require Tcompiler="ARMCC"/>   
      <require Toptions="AC5"/>      
    </condition> 

    <condition id="XMC13xx ARMCC6">                                     
      <description>Infineon XMC13xx series and ARMCC compiler</description>
      <accept condition="XMC1301_Q24"/>
      <accept condition="XMC1301_Q40"/>
      <accept condition="XMC1301_T16"/>
      <accept condition="XMC1301_T38"/>
      <accept condition="XMC1302_Q24"/>
      <accept condition="XMC1302_Q40"/>
      <accept condition="XMC1302_T16"/>
      <accept condition="XMC1302_T28"/>
      <accept condition="XMC1302_T38"/>
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6"/>
    </condition> 

    <condition id="XMC13xx ARMCC6LTO">                                     
      <description>Infineon XMC13xx series and ARMCC compiler</description>
      <accept condition="XMC1301_Q24"/>
      <accept condition="XMC1301_Q40"/>
      <accept condition="XMC1301_T16"/>
      <accept condition="XMC1301_T38"/>
      <accept condition="XMC1302_Q24"/>
      <accept condition="XMC1302_Q40"/>
      <accept condition="XMC1302_T16"/>
      <accept condition="XMC1302_T28"/>
      <accept condition="XMC1302_T38"/>
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6LTO"/>
    </condition> 

    <condition id="XMC13xx IAR">                                     
      <description>Infineon XMC13xx series and IAR compiler</description>
      <accept condition="XMC1301_Q24"/>
      <accept condition="XMC1301_Q40"/>
      <accept condition="XMC1301_T16"/>
      <accept condition="XMC1301_T38"/>
      <accept condition="XMC1302_Q24"/>
      <accept condition="XMC1302_Q40"/>
      <accept condition="XMC1302_T16"/>
      <accept condition="XMC1302_T28"/>
      <accept condition="XMC1302_T38"/>
      <require Tcompiler="IAR"/>    
    </condition> 

