mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC1000_DFP.2.11.0.pdsc
    <condition id="XMC13xx GCC">                                     
      <description>Infineon XMC13xx series and GCC compiler</description>
      <accept condition="XMC1301_Q24"/>
      <accept condition="XMC1301_Q40"/>
      <accept condition="XMC1301_T16"/>
      <accept condition="XMC1301_T38"/>
      <accept condition="XMC1302_Q24"/>
      <accept condition="XMC1302_Q40"/>
      <accept condition="XMC1302_T16"/>
      <accept condition="XMC1302_T28"/>
      <accept condition="XMC1302_T38"/>
      <require Tcompiler="GCC"/>    
    </condition> 
    
    <condition id="XMC13xx_0008_GCC">                                     
      <description>Infineon XMC13xx series and GCC compiler with 8K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC13??-*x0008"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC13xx_0016_GCC">                                     
      <description>Infineon XMC13xx series and GCC compiler with 16K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC13??-*x0016"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC13xx_0032_GCC">                                     
      <description>Infineon XMC13xx series and GCC compiler with 32K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC13??-*x0032"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC13xx_0064_GCC">                                     
      <description>Infineon XMC13xx series and GCC compiler with 64K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC13??-*x0064"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC13xx_0128_GCC">                                     
      <description>Infineon XMC13xx series and GCC compiler with 128K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC13??-*x0128"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC13xx_0200_GCC">                                     
      <description>Infineon XMC13xx series and GCC compiler with 200K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC13??-*x0200"/>            
      <require Tcompiler="GCC"/>    
    </condition>

    <condition id="XMC13xx_0008_ARMCC6">                                     
      <description>Infineon XMC13xx series and GCC compiler with 8K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC13??-*x0008"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6"/>
    </condition>

    <condition id="XMC13xx_0008_ARMCC6LTO">                                     
      <description>Infineon XMC13xx series and GCC compiler with 8K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC13??-*x0008"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6LTO"/>
    </condition>

    <condition id="XMC13xx_0016_ARMCC6">                                     
      <description>Infineon XMC13xx series and GCC compiler with 16K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC13??-*x0016"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6"/>
    </condition>

    <condition id="XMC13xx_0016_ARMCC6LTO">                                     
      <description>Infineon XMC13xx series and GCC compiler with 16K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC13??-*x0016"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6LTO"/>
    </condition>

    <condition id="XMC13xx_0032_ARMCC6">                                     
      <description>Infineon XMC13xx series and GCC compiler with 32K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC13??-*x0032"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6"/>
    </condition>

    <condition id="XMC13xx_0032_ARMCC6LTO">                                     
      <description>Infineon XMC13xx series and GCC compiler with 32K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC13??-*x0032"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6LTO"/>
    </condition>

    <condition id="XMC13xx_0064_ARMCC6">                                     
      <description>Infineon XMC13xx series and GCC compiler with 64K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC13??-*x0064"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6"/>
    </condition>

    <condition id="XMC13xx_0064_ARMCC6LTO">                                     
      <description>Infineon XMC13xx series and GCC compiler with 64K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC13??-*x0064"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6LTO"/>
    </condition>

    <condition id="XMC13xx_0128_ARMCC6">                                     
      <description>Infineon XMC13xx series and GCC compiler with 128K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC13??-*x0128"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6"/>
    </condition>

    <condition id="XMC13xx_0128_ARMCC6LTO">                                     
      <description>Infineon XMC13xx series and GCC compiler with 128K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC13??-*x0128"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6LTO"/>
    </condition>

    <condition id="XMC13xx_0200_ARMCC6">                                     
      <description>Infineon XMC13xx series and GCC compiler with 200K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC13??-*x0200"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6"/>
    </condition>

    <condition id="XMC13xx_0200_ARMCC6LTO">                                     
      <description>Infineon XMC13xx series and GCC compiler with 200K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC13??-*x0200"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6LTO"/>
    </condition>

    <condition id="XMC13xx">                                     
      <description>Infineon XMC13xx series</description>
      <accept condition="XMC13xx ARM"/>
      <accept condition="XMC13xx ARMCC6"/>
      <accept condition="XMC13xx ARMCC6LTO"/>
      <accept condition="XMC13xx IAR"/>   
      <accept condition="XMC13xx GCC"/>   
    </condition>
  
    <condition id="XMC1401_Q48">                                     
      <description>Infineon XMC1401 series VQFN48</description>   
      <require Dvendor="Infineon:7" Dname="XMC1401-Q048*"/>      
    </condition>

