mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC1000_DFP.2.11.0.pdsc
    <condition id="XMC14xx_0064_ARMCC6">                                     
      <description>Infineon XMC14xx series and GCC compiler with 64K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC14??-*x0064"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6"/>
    </condition>

    <condition id="XMC14xx_0064_ARMCC6LTO">                                     
      <description>Infineon XMC14xx series and GCC compiler with 64K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC14??-*x0064"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6LTO"/>
    </condition>

    <condition id="XMC14xx_0128_ARMCC6">                                     
      <description>Infineon XMC14xx series and GCC compiler with 128K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC14??-*x0128"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6"/>
    </condition>

    <condition id="XMC14xx_0128_ARMCC6LTO">                                     
      <description>Infineon XMC14xx series and GCC compiler with 128K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC14??-*x0128"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6LTO"/>
    </condition>

    <condition id="XMC14xx_0200_ARMCC6">                                     
      <description>Infineon XMC14xx series and GCC compiler with 200K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC14??-*x0200"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6"/>
    </condition>

    <condition id="XMC14xx_0200_ARMCC6LTO">                                     
      <description>Infineon XMC14xx series and GCC compiler with 200K Flash</description>
      <require Dvendor="Infineon:7" Dname="XMC14??-*x0200"/>            
      <require Tcompiler="ARMCC"/>    
      <require Toptions="AC6LTO"/>
    </condition>

    <condition id="XMC1402">                                     
      <description>Infineon XMC1402 series</description>
      <accept condition="XMC1402 ARM"/>
      <accept condition="XMC1402 IAR"/>   
      <accept condition="XMC1402 GCC"/>   
    </condition>  
  
    <condition id="XMC1403 ARM">                                     
      <description>Infineon XMC1403 CAN series and ARMCC compilert</description>
      <accept condition="XMC1403_Q40"/>
      <accept condition="XMC1403_Q48"/>
      <accept condition="XMC1403_Q64"/>
     <require Tcompiler="ARMCC"/>     
    </condition> 

    <condition id="XMC1403 IAR">                                     
      <description>Infineon XMC1403 CAN series and IAR compilert</description>
      <accept condition="XMC1403_Q40"/>
      <accept condition="XMC1403_Q48"/>
      <accept condition="XMC1403_Q64"/>
      <require Tcompiler="IAR"/>      
    </condition> 

    <condition id="XMC1403 GCC">                                     
      <description>Infineon XMC1403 CAN series and GCC compilert</description>
      <accept condition="XMC1403_Q48"/>
      <accept condition="XMC1403_Q64"/>
      <require Tcompiler="GCC"/>     
    </condition> 

    <condition id="XMC1403">                                     
      <description>Infineon XMC1403 series</description>
      <accept condition="XMC1403 ARM"/>
      <accept condition="XMC1403 IAR"/>   
      <accept condition="XMC1403 GCC"/>   
    </condition>
  
    <condition id="XMC1404 ARM">                                     
      <description>Infineon XMC1404 CAN Control series and ARMCC compiler</description>
      <accept condition="XMC1404_Q40"/>
      <accept condition="XMC1404_Q48"/>
      <accept condition="XMC1404_Q64"/>
      <accept condition="XMC1404_F64"/>
      <require Tcompiler="ARMCC"/>      
    </condition> 

    <condition id="XMC1404 IAR">                                     
      <description>Infineon XMC1404 CAN Control series and IAR compiler</description>
      <accept condition="XMC1404_Q40"/>
      <accept condition="XMC1404_Q48"/>
      <accept condition="XMC1404_Q64"/>
      <accept condition="XMC1404_F64"/>
      <require Tcompiler="IAR"/>      
    </condition> 

    <condition id="XMC1404 GCC">                                     
      <description>Infineon XMC1404 CAN Control series and GCC compiler</description>
      <accept condition="XMC1404_Q40"/>
      <accept condition="XMC1404_Q48"/>
      <accept condition="XMC1404_Q64"/>
      <accept condition="XMC1404_F64"/>
      <require Tcompiler="GCC"/>     
    </condition> 

    <condition id="XMC1404">                                     
      <description>Infineon XMC1404 series</description>
      <accept condition="XMC1404 ARM"/>
      <accept condition="XMC1404 IAR"/>   
      <accept condition="XMC1404 GCC"/>   
    </condition>
    
    <condition id="XMC14xx ARM">                                     
      <description>Infineon XMC14xx series and ARMCC compiler</description>
      <accept condition="XMC1401_Q48"/>
      <accept condition="XMC1401_F64"/>
      <accept condition="XMC1402_T38"/>
      <accept condition="XMC1402_Q40"/>
      <accept condition="XMC1402_Q48"/>
      <accept condition="XMC1402_Q64"/>
      <accept condition="XMC1402_F64"/>
      <accept condition="XMC1403_Q40"/>
      <accept condition="XMC1403_Q48"/>
      <accept condition="XMC1403_Q64"/>
      <accept condition="XMC1404_Q40"/>
      <accept condition="XMC1404_Q48"/>
      <accept condition="XMC1404_Q64"/>
      <accept condition="XMC1404_F64"/>
      <require Tcompiler="ARMCC"/>  
      <require Toptions="AC5"/>      
    </condition> 

    <condition id="XMC14xx ARMCC6">                                     
      <description>Infineon XMC14xx series and ARMCC compiler</description>
      <accept condition="XMC1401_Q48"/>
      <accept condition="XMC1401_F64"/>
      <accept condition="XMC1402_T38"/>
      <accept condition="XMC1402_Q40"/>
      <accept condition="XMC1402_Q48"/>
      <accept condition="XMC1402_Q64"/>
      <accept condition="XMC1402_F64"/>
      <accept condition="XMC1403_Q40"/>
      <accept condition="XMC1403_Q48"/>
      <accept condition="XMC1403_Q64"/>
      <accept condition="XMC1404_Q40"/>
      <accept condition="XMC1404_Q48"/>
      <accept condition="XMC1404_Q64"/>
      <accept condition="XMC1404_F64"/>
      <require Tcompiler="ARMCC"/>   
      <require Toptions="AC6"/>
    </condition> 

