mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC1000_DFP.2.11.0.pdsc
    <condition id="XMC1 CMSIS Driver SAI">
      <description>Infineon XMC1000 family, XMC1 CMSIS Driver SAI</description>
      <require condition="XMC1 CMSIS"/>
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="I2S"/>
    </condition>    

    <condition id="XMC1 CMSIS Driver CAN">
      <description>Infineon XMC1000 family, XMC1 CMSIS Driver CAN</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Startup"/> 
      <accept Dvendor="Infineon:7" Dname="XMC1403*"/>     
      <accept Dvendor="Infineon:7" Dname="XMC1404*"/>     
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="CAN"/>
    </condition>    

    <condition id="XMC1 HAL GPIO">
      <description>Infineon XMC1000 family, XMC1 GPIO driver</description>
      <require condition="XMC1 CMSIS"/>          
      <require Cclass ="Device" Cgroup="XMClib" Csub="GPIO" />    
    </condition>

    <condition id="XMC1 HAL VADC">
      <description>Infineon XMC1000 family, XMC1 ADC driver</description>
      <require condition="XMC1 CMSIS"/>   
      <require Cclass ="Device" Cgroup="XMClib" Csub="GPIO" />               
      <require Cclass ="Device" Cgroup="XMClib" Csub="VADC" />    
    </condition>

  </conditions>

  
  <examples>
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC_2Go/Blinky">
      <description>UART based Blinky example</description>
      <board name="XMC 2Go" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="RTX_Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC_2Go/RTX_Blinky">
      <description>CMSIS RTOS RTX based Blinky example</description>
      <board name="XMC 2Go" vendor="Infineon"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC1100 Boot Kit/Blinky">
      <description>Blinky example</description>
      <board name="XMC1100 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="RTX_Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC1100 Boot Kit/RTX_Blinky">
      <description>CMSIS RTOS RTX based Blinky example</description>
      <board name="XMC1100 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="CMSIS DRIVER_SPI" doc="Abstract.txt" folder="Boards/Infineon/XMC1100 Boot Kit/CMSIS DRIVER_SPI">
      <description>CMSIS DRIVER SPI example</description>
      <board name="XMC1100 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="SPI_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="CMSIS DRIVER_UART" doc="Abstract.txt" folder="Boards/Infineon/XMC1100 Boot Kit/CMSIS DRIVER_UART">
      <description>CMSIS DRIVER UART example</description>
      <board name="XMC1100 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="UART_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC1200 Boot Kit/Blinky">
      <description>Blinky example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="RTX_Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC1200 Boot Kit/RTX_Blinky">
      <description>CMSIS RTOS RTX based Blinky example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="CMSIS DRIVER_SPI" doc="Abstract.txt" folder="Boards/Infineon/XMC1200 Boot Kit/CMSIS DRIVER_SPI">
      <description>CMSIS DRIVER SPI example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="SPI_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    <example name="CMSIS DRIVER_UART" doc="Abstract.txt" folder="Boards/Infineon/XMC1200 Boot Kit/CMSIS DRIVER_UART">
      <description>CMSIS DRIVER UART example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="UART_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC1300 Boot Kit/Blinky">
      <description>Blinky example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="RTX_Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC1300 Boot Kit/RTX_Blinky">
      <description>CMSIS RTOS RTX based Blinky example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="CMSIS DRIVER_SPI" doc="Abstract.txt" folder="Boards/Infineon/XMC1300 Boot Kit/CMSIS DRIVER_SPI">
      <description>CMSIS DRIVER SPI example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="SPI_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="CMSIS DRIVER_UART" doc="Abstract.txt" folder="Boards/Infineon/XMC1300 Boot Kit/CMSIS DRIVER_UART">
      <description>CMSIS DRIVER UART example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="UART_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="XMC1300_TSE" doc="Abstract.txt" folder="Boards/Infineon/XMC1300 Boot Kit/XMC1300_TSE">
      <description>Temperature Sensor example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="XMC1300_TSE.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    
    <example name="Blinky example" doc="Abstract.txt" folder="Boards/Infineon/XMC1400 Boot Kit/Blinky">
      <description>Blink LEDs in board</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="XMC1400_EasyStart.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
  
    <example name="RTX_Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC1400 Boot Kit/RTX_Blinky">
      <description>CMSIS RTOS RTX based Blinky example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="CMSIS DRIVER_SPI" doc="Abstract.txt" folder="Boards/Infineon/XMC1400 Boot Kit/CMSIS DRIVER_SPI">
      <description>CMSIS DRIVER SPI example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="SPI_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS Driver" Cgroup="SPI"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="CMSIS DRIVER_UART" doc="Abstract.txt" folder="Boards/Infineon/XMC1400 Boot Kit/CMSIS DRIVER_UART">
      <description>CMSIS DRIVER UART example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="UART_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS Driver" Cgroup="UART"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

