mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC1000_DFP.2.11.0.pdsc
    <example name="CAN_LOOPBACK" doc="Abstract.txt" folder="Boards/Infineon/XMC1400 Boot Kit/CAN/CAN_LOOPBACK">
      <description>CMSIS DRIVER CAN LOOPBACK example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="CAN_LOOPBACK.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS Driver" Cgroup="CAN"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    
    <example name="CAN_TRANSMIT" doc="Abstract.txt" folder="Boards/Infineon/XMC1400 Boot Kit/CAN/CAN_TRANSMIT">
      <description>CMSIS DRIVER CAN TRANSMIT example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="CAN_TRANSMIT.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS Driver" Cgroup="CAN"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="RGB_LED_Basic" doc="Abstract.txt" folder="Boards/Infineon/XMC_RGB_LED_Lighting_Shield/Basic">
      <description>RGB LED shield basic example</description>
      <board name="RGB LED Lighting Shield" vendor="Infineon"/>
      <project>
        <environment name="uv" load="RGB_LED_Basic.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="ACMP"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="BCCU"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU4"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>        
        <category>Getting Started</category>
      </attributes>
    </example>

    <!-- Infineon XMC1 Low Level Driver (LLD) Examples -->

    <!-- XMC1100 examples -->    
    <example name="GPIO_TOGGLE_XMC11" doc="Readme.txt" folder="Device/XMClib/examples/XMC1100_series/GPIO/GPIO_TOGGLE">
      <description>XMClib GPIO example</description>
      <board name="XMC1100 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/gpio_toggle_xmc11.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="UART_TRANSMIT_XMC11" doc="Readme.txt" folder="Device/XMClib/examples/XMC1100_series/UART/UART_TRANSMIT">
      <description>XMClib UART example</description>
      <board name="XMC1100 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/uart_transmit_xmc11.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="UART"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>    

    <example name="VADC_BG_XMC11" doc="Readme.txt" folder="Device/XMClib/examples/XMC1100_series/VADC/VADC_BG">
      <description>XMClib VADC example</description>
      <board name="XMC1100 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/VADC_BG_xmc11.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="VADC"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>      

    <!-- XMC1200 examples -->    
    <example name="ACMP_CMP_XMC12" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/ANACMP/ACMP_CMP">
      <description>XMClib ANACMP example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/anacmp_cmp_xmc12.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="ANACMP"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="BCCU_LED_XMC12" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/BCCU/BCCU_LED">
      <description>XMClib BCCU example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/bccu_led_xmc12.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="BCCU"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <example name="CCU4_TIMER_XMC12" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/CCU4/CCU4_TIMER">
      <description>XMClib CCU4 example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ccu4_timer_xmc12.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU4"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="ERU_EXTINT_XMC12" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/ERU/ERU_EXTINT">
      <description>XMClib ERU example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/eru_extint_xmc12.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="ERU"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <example name="GPIO_TOGGLE_XMC12" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/GPIO/GPIO_TOGGLE">
      <description>XMClib GPIO example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/gpio_toggle_xmc12.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="LEDTS_7_Segment_Display_Example1_XMC12" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/LEDTS/LEDTS_7_Segment_Display_Example1">
      <description>XMClib LEDTS Example1</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ledts_example1_xmc12.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="LEDTS"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="LEDTS_7_Segment_Display_Example2_XMC12" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/LEDTS/LEDTS_7_Segment_Display_Example2">
      <description>XMClib LEDTS Example2</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ledts_example2_xmc12.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="LEDTS"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="RTC_ALARM_XMC12" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/RTC/RTC_ALARM">
      <description>XMClib RTC example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/rtc_alarm_xmc12.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="RTC"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>   

