mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC1000_DFP.2.11.0.pdsc
    <example name="SPI_TRANSMIT_XMC12" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/SPI/SPI_TRANSMIT">
      <description>XMClib SPI example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/spi_transmit_xmc12.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SPI"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="UART_TRANSMIT_XMC12" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/UART/UART_TRANSMIT">
      <description>XMClib UART example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/uart_transmit_xmc12.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="UART"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>    

    <example name="VADC_MEASUREMENT_XMC12" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/VADC/VADC_MEASUREMENT">
      <description>XMClib VADC example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/vadc_measurement_xmc12.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="VADC"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>      

    <example name="WDT_FEED_XMC12" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/WDT/WDT_FEED">
      <description>XMClib WDT example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/wdt_feed_xmc12.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="WDT"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>      

    <!-- XMC1300 examples -->    
    <example name="ACMP_CMP_XMC13" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/ANACMP/ACMP_CMP">
      <description>XMClib ANACMP example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/anacmp_cmp_xmc13.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="ANACMP"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="CCU4_TIMER_XMC13" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/CCU4/CCU4_TIMER">
      <description>XMClib CCU4 example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ccu4_timer_xmc13.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU4"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <example name="CCU8_TIMER_XMC13" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/CCU8/CCU8_TIMER">
      <description>XMClib CCU8 example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ccu8_timer_xmc13.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU8"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <example name="ERU_EXTINT_XMC13" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/ERU/ERU_EXTINT">
      <description>XMClib ERU example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/eru_extint_xmc13.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="ERU"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="FLASH_PROGRAM_XMC13" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/FLASH/FLASH_PROGRAM">
      <description>XMClib FLASH example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/flash_program_xmc13.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="FLASH"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="GPIO_TOGGLE_XMC13" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/GPIO/GPIO_TOGGLE">
      <description>XMClib GPIO example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/gpio_toggle_xmc13.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="MATH_SQRT_XMC13" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/MATH/MATH_SQRT">
      <description>XMClib GPIO example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/math_sqrt_xmc13.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="MATH"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="RTC_ALARM_XMC13" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/RTC/RTC_ALARM">
      <description>XMClib RTC example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/rtc_alarm_xmc13.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="RTC"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>                         

    <example name="SPI_TRANSMIT_XMC13" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/SPI/SPI_TRANSMIT">
      <description>XMClib SPI example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/spi_transmit_xmc13.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SPI"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>    

    <example name="UART_TRANSMIT_XMC13" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/UART/UART_TRANSMIT">
      <description>XMClib UART example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/uart_transmit_xmc13.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="UART"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="UART_SHELL_XMC13" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/UART/UART_SHELL">
      <description>XMClib UART example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/uart_shell_xmc13.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="UART"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="VADC_MEASUREMENT_XMC13" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/VADC/VADC_MEASUREMENT">
      <description>XMClib VADC example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/vadc_measurement_xmc13.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="VADC"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="WDT_FEED_XMC13" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/WDT/WDT_FEED">
      <description>XMClib WDT example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/wdt_feed_xmc13.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="WDT"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <!-- XMC1400 examples -->    
    <example name="CAN_LOOPBACK_EXT_OSC_XMC14" doc="Readme.txt" folder="Device/XMClib/examples/XMC1400_series/CAN/CAN_LOOPBACK_EXT_OSC">
      <description>XMClib CAN example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/can_loopback_ext_osc_xmc14.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CAN"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    
    <example name="CAN_RECEIVER_XMC14" doc="Readme.txt" folder="Device/XMClib/examples/XMC1400_series/CAN/CAN_RECEIVER">
      <description>XMClib CAN example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/can_receiver_xmc14.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CAN"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="CAN_TRANSMITTER_XMC14" doc="Readme.txt" folder="Device/XMClib/examples/XMC1400_series/CAN/CAN_TRANSMITTER">
      <description>XMClib CAN example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/can_transmitter_xmc14.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CAN"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="CCU4_TIMER_XMC14" doc="Readme.txt" folder="Device/XMClib/examples/XMC1400_series/CCU4/CCU4_TIMER">
      <description>XMClib CCU4 example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ccu4_timer_xmc14.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU4"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 
    
