mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC1000_DFP.2.11.0.pdsc
    <example name="CCU8_TIMER_XMC14" doc="Readme.txt" folder="Device/XMClib/examples/XMC1400_series/CCU8/CCU8_TIMER">
      <description>XMClib CCU8 example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ccu8_timer_xmc14.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU8"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 
 
    <example name="FREERTOS_BLINKY_XMC14" doc="Readme.txt" folder="Device/XMClib/examples/XMC1400_series/FREERTOS/FREERTOS_BLINKY">
      <description>XMClib CCU8 example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/freertos_blinky_xmc14.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <example name="I2C_EEPROM_XMC14" doc="Readme.txt" folder="Device/XMClib/examples/XMC1400_series/I2C/I2C_EEPROM">
      <description>XMClib CCU8 example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/i2c_eeprom_xmc14.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="I2C"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <example name="MATH_SQRT_XMC14" doc="Readme.txt" folder="Device/XMClib/examples/XMC1400_series/MATH/MATH_SQRT">
      <description>XMClib CCU8 example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/math_sqrt_xmc14.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="MATH"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <example name="SCU_WAKEUP_XMC14" doc="Readme.txt" folder="Device/XMClib/examples/XMC1400_series/SCU/SCU_WAKEUP">
      <description>XMClib CCU8 example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/scu_wakeup_xmc14.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <example name="TSE_CALC_TEMPERATURE_XMC14" doc="Readme.txt" folder="Device/XMClib/examples/XMC1400_series/TSE/TSE_CALC_TEMPERATURE">
      <description>XMClib CCU8 example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/TSE_CALC_TEMPERATURE_XMC14.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <example name="UART_SHELL_XMC14" doc="Readme.txt" folder="Device/XMClib/examples/XMC1400_series/UART/UART_SHELL">
      <description>XMClib CCU8 example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/uart_shell_xmc14.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="UART"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 

  </examples>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="XMC1">
      <description>System Startup for Infineon XMC1000 device series</description>
      <files>
        <!--  include folder -->
        <file category="include" name="Device/XMC1100_series/Include/"  condition="XMC11xx"/>
        <file category="include" name="Device/XMC1200_series/Include/"  condition="XMC12xx"/>
        <file category="include" name="Device/XMC1300_series/Include/"  condition="XMC13xx"/>
        <file category="include" name="Device/XMC1400_series/Include/"  condition="XMC14xx"/>
        
       <!-- startup files -->
        <file category="source" name="Device/XMC1100_series/Source/ARM/startup_XMC1100.s" attr="config"      version="1.4.0" condition="XMC11xx ARM"/>
        <file category="source" name="Device/XMC1200_series/Source/ARM/startup_XMC1200.s" attr="config"      version="1.4.0" condition="XMC12xx ARM"/>
        <file category="source" name="Device/XMC1300_series/Source/ARM/startup_XMC1300.s" attr="config"      version="1.4.0" condition="XMC13xx ARM"/>  
        <file category="source" name="Device/XMC1400_series/Source/ARM/startup_XMC1400.s" attr="config"      version="1.2.0" condition="XMC14xx ARM"/> 

        <file category="source" name="Device/XMC1100_series/Source/ARM6/startup_XMC1100.asm" attr="config"      version="1.0.0" condition="XMC11xx ARMCC6"/>
        <file category="source" name="Device/XMC1200_series/Source/ARM6/startup_XMC1200.asm" attr="config"      version="1.0.0" condition="XMC12xx ARMCC6"/>
        <file category="source" name="Device/XMC1300_series/Source/ARM6/startup_XMC1300.asm" attr="config"      version="1.0.0" condition="XMC13xx ARMCC6"/>  
        <file category="source" name="Device/XMC1400_series/Source/ARM6/startup_XMC1400.asm" attr="config"      version="1.0.0" condition="XMC14xx ARMCC6"/> 

        <file category="source" name="Device/XMC1100_series/Source/ARM6/startup_XMC1100.asm" attr="config"      version="1.0.0" condition="XMC11xx ARMCC6LTO"/>
        <file category="source" name="Device/XMC1200_series/Source/ARM6/startup_XMC1200.asm" attr="config"      version="1.0.0" condition="XMC12xx ARMCC6LTO"/>
        <file category="source" name="Device/XMC1300_series/Source/ARM6/startup_XMC1300.asm" attr="config"      version="1.0.0" condition="XMC13xx ARMCC6LTO"/>  
        <file category="source" name="Device/XMC1400_series/Source/ARM6/startup_XMC1400.asm" attr="config"      version="1.0.0" condition="XMC14xx ARMCC6LTO"/> 

        <file category="source" name="Device/XMC1100_series/Source/IAR/startup_XMC1100.s" attr="config"      version="1.20.0" condition="XMC11xx IAR"/>
        <file category="source" name="Device/XMC1200_series/Source/IAR/startup_XMC1200.s" attr="config"      version="1.20.0" condition="XMC12xx IAR"/>
        <file category="source" name="Device/XMC1300_series/Source/IAR/startup_XMC1300.s" attr="config"      version="1.20.0" condition="XMC13xx IAR"/>  
        <file category="source" name="Device/XMC1400_series/Source/IAR/startup_XMC1400.s" attr="config"      version="2.0.0" condition="XMC14xx IAR"/> 

        <file category="source" name="Device/XMC1100_series/Source/GCC/startup_XMC1100.S" attr="config"      version="1.15.0" condition="XMC11xx GCC"/>
        <file category="source" name="Device/XMC1200_series/Source/GCC/startup_XMC1200.S" attr="config"      version="1.15.0" condition="XMC12xx GCC"/>
        <file category="source" name="Device/XMC1300_series/Source/GCC/startup_XMC1300.S" attr="config"      version="1.15.0" condition="XMC13xx GCC"/>  
        <file category="source" name="Device/XMC1400_series/Source/GCC/startup_XMC1400.S" attr="config"      version="1.2.0" condition="XMC14xx GCC"/> 

