mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC1000_DFP.2.11.0.pdsc
        <file category="source" name="Compiler/GCC/syscalls.c" version="1.6.0" condition="XMC1 GCC"/>

        <!-- system file -->      
        <file category="source" name="Device/XMC1100_series/Source/system_XMC1100.c"      attr="config"      version="1.12.0" condition="XMC11xx"/>
        <file category="source" name="Device/XMC1200_series/Source/system_XMC1200.c"      attr="config"      version="1.12.0" condition="XMC12xx"/>
        <file category="source" name="Device/XMC1300_series/Source/system_XMC1300.c"      attr="config"      version="1.12.0" condition="XMC13xx"/>
        <file category="source" name="Device/XMC1400_series/Source/system_XMC1400.c"      attr="config"      version="1.6.0" condition="XMC14xx"/>       
        
        <!-- linker files -->
        <file category="linkerScript" name="Device/XMC1100_series/Source/GCC/XMC1100x0008.ld"  version="1.9.0" attr="config" condition="XMC11xx_0008_GCC"/>
        <file category="linkerScript" name="Device/XMC1100_series/Source/GCC/XMC1100x0016.ld"  version="1.9.0" attr="config" condition="XMC11xx_0016_GCC"/>
        <file category="linkerScript" name="Device/XMC1100_series/Source/GCC/XMC1100x0032.ld"  version="1.9.0" attr="config" condition="XMC11xx_0032_GCC"/>
        <file category="linkerScript" name="Device/XMC1100_series/Source/GCC/XMC1100x0064.ld"  version="1.9.0" attr="config" condition="XMC11xx_0064_GCC"/>
        <file category="linkerScript" name="Device/XMC1200_series/Source/GCC/XMC1200x0016.ld"  version="1.10.0" attr="config" condition="XMC12xx_0016_GCC"/>
        <file category="linkerScript" name="Device/XMC1200_series/Source/GCC/XMC1200x0032.ld"  version="1.9.0" attr="config" condition="XMC12xx_0032_GCC"/>
        <file category="linkerScript" name="Device/XMC1200_series/Source/GCC/XMC1200x0064.ld"  version="1.10.0" attr="config" condition="XMC12xx_0064_GCC"/>
        <file category="linkerScript" name="Device/XMC1200_series/Source/GCC/XMC1200x0128.ld"  version="1.9.0" attr="config" condition="XMC12xx_0128_GCC"/>
        <file category="linkerScript" name="Device/XMC1200_series/Source/GCC/XMC1200x0200.ld"  version="1.9.0" attr="config" condition="XMC12xx_0200_GCC"/>
        <file category="linkerScript" name="Device/XMC1300_series/Source/GCC/XMC1300x0008.ld"  version="1.9.0" attr="config" condition="XMC13xx_0008_GCC"/>
        <file category="linkerScript" name="Device/XMC1300_series/Source/GCC/XMC1300x0016.ld"  version="1.10.0" attr="config" condition="XMC13xx_0016_GCC"/>
        <file category="linkerScript" name="Device/XMC1300_series/Source/GCC/XMC1300x0032.ld"  version="1.10.0" attr="config" condition="XMC13xx_0032_GCC"/>
        <file category="linkerScript" name="Device/XMC1300_series/Source/GCC/XMC1300x0064.ld"  version="1.9.0" attr="config" condition="XMC13xx_0064_GCC"/>
        <file category="linkerScript" name="Device/XMC1300_series/Source/GCC/XMC1300x0128.ld"  version="1.9.0" attr="config" condition="XMC13xx_0128_GCC"/>
        <file category="linkerScript" name="Device/XMC1300_series/Source/GCC/XMC1300x0200.ld"  version="1.10.0" attr="config" condition="XMC13xx_0200_GCC"/>
        <file category="linkerScript" name="Device/XMC1400_series/Source/GCC/XMC1400x0032.ld"  version="1.4.0" attr="config" condition="XMC14xx_0032_GCC"/>
        <file category="linkerScript" name="Device/XMC1400_series/Source/GCC/XMC1400x0064.ld"  version="1.4.0" attr="config" condition="XMC14xx_0064_GCC"/>
        <file category="linkerScript" name="Device/XMC1400_series/Source/GCC/XMC1400x0128.ld"  version="1.4.0" attr="config" condition="XMC14xx_0128_GCC"/>
        <file category="linkerScript" name="Device/XMC1400_series/Source/GCC/XMC1400x0200.ld"  version="1.4.0" attr="config" condition="XMC14xx_0200_GCC"/>

        <file category="linkerScript" name="Device/XMC1100_series/Source/ARM6/XMC1100x0008.sct"  version="1.0.0" attr="config" condition="XMC11xx_0008_ARMCC6"/>
        <file category="linkerScript" name="Device/XMC1100_series/Source/ARM6/XMC1100x0016.sct"  version="1.0.0" attr="config" condition="XMC11xx_0016_ARMCC6"/>
        <file category="linkerScript" name="Device/XMC1100_series/Source/ARM6/XMC1100x0032.sct"  version="1.0.0" attr="config" condition="XMC11xx_0032_ARMCC6"/>
        <file category="linkerScript" name="Device/XMC1100_series/Source/ARM6/XMC1100x0064.sct"  version="1.0.0" attr="config" condition="XMC11xx_0064_ARMCC6"/>
        <file category="linkerScript" name="Device/XMC1200_series/Source/ARM6/XMC1200x0016.sct"  version="1.0.0" attr="config" condition="XMC12xx_0016_ARMCC6"/>
        <file category="linkerScript" name="Device/XMC1200_series/Source/ARM6/XMC1200x0032.sct"  version="1.0.0" attr="config" condition="XMC12xx_0032_ARMCC6"/>
        <file category="linkerScript" name="Device/XMC1200_series/Source/ARM6/XMC1200x0064.sct"  version="1.0.0" attr="config" condition="XMC12xx_0064_ARMCC6"/>
        <file category="linkerScript" name="Device/XMC1200_series/Source/ARM6/XMC1200x0128.sct"  version="1.0.0" attr="config" condition="XMC12xx_0128_ARMCC6"/>
        <file category="linkerScript" name="Device/XMC1200_series/Source/ARM6/XMC1200x0200.sct"  version="1.0.0" attr="config" condition="XMC12xx_0200_ARMCC6"/>
        <file category="linkerScript" name="Device/XMC1300_series/Source/ARM6/XMC1300x0008.sct"  version="1.0.0" attr="config" condition="XMC13xx_0008_ARMCC6"/>
        <file category="linkerScript" name="Device/XMC1300_series/Source/ARM6/XMC1300x0016.sct"  version="1.0.0" attr="config" condition="XMC13xx_0016_ARMCC6"/>
        <file category="linkerScript" name="Device/XMC1300_series/Source/ARM6/XMC1300x0032.sct"  version="1.0.0" attr="config" condition="XMC13xx_0032_ARMCC6"/>
        <file category="linkerScript" name="Device/XMC1300_series/Source/ARM6/XMC1300x0064.sct"  version="1.0.0" attr="config" condition="XMC13xx_0064_ARMCC6"/>
        <file category="linkerScript" name="Device/XMC1300_series/Source/ARM6/XMC1300x0128.sct"  version="1.0.0" attr="config" condition="XMC13xx_0128_ARMCC6"/>
        <file category="linkerScript" name="Device/XMC1300_series/Source/ARM6/XMC1300x0200.sct"  version="1.0.0" attr="config" condition="XMC13xx_0200_ARMCC6"/>
        <file category="linkerScript" name="Device/XMC1400_series/Source/ARM6/XMC1400x0032.sct"  version="1.0.0" attr="config" condition="XMC14xx_0032_ARMCC6"/>
        <file category="linkerScript" name="Device/XMC1400_series/Source/ARM6/XMC1400x0064.sct"  version="1.0.0" attr="config" condition="XMC14xx_0064_ARMCC6"/>
        <file category="linkerScript" name="Device/XMC1400_series/Source/ARM6/XMC1400x0128.sct"  version="1.0.0" attr="config" condition="XMC14xx_0128_ARMCC6"/>
        <file category="linkerScript" name="Device/XMC1400_series/Source/ARM6/XMC1400x0200.sct"  version="1.0.0" attr="config" condition="XMC14xx_0200_ARMCC6"/>

        <file category="linkerScript" name="Device/XMC1100_series/Source/ARM6/XMC1100x0008.sct"  version="1.0.0" attr="config" condition="XMC11xx_0008_ARMCC6LTO"/>
        <file category="linkerScript" name="Device/XMC1100_series/Source/ARM6/XMC1100x0016.sct"  version="1.0.0" attr="config" condition="XMC11xx_0016_ARMCC6LTO"/>
        <file category="linkerScript" name="Device/XMC1100_series/Source/ARM6/XMC1100x0032.sct"  version="1.0.0" attr="config" condition="XMC11xx_0032_ARMCC6LTO"/>
        <file category="linkerScript" name="Device/XMC1100_series/Source/ARM6/XMC1100x0064.sct"  version="1.0.0" attr="config" condition="XMC11xx_0064_ARMCC6LTO"/>
        <file category="linkerScript" name="Device/XMC1200_series/Source/ARM6/XMC1200x0016.sct"  version="1.0.0" attr="config" condition="XMC12xx_0016_ARMCC6LTO"/>
        <file category="linkerScript" name="Device/XMC1200_series/Source/ARM6/XMC1200x0032.sct"  version="1.0.0" attr="config" condition="XMC12xx_0032_ARMCC6LTO"/>
        <file category="linkerScript" name="Device/XMC1200_series/Source/ARM6/XMC1200x0064.sct"  version="1.0.0" attr="config" condition="XMC12xx_0064_ARMCC6LTO"/>
        <file category="linkerScript" name="Device/XMC1200_series/Source/ARM6/XMC1200x0128.sct"  version="1.0.0" attr="config" condition="XMC12xx_0128_ARMCC6LTO"/>
        <file category="linkerScript" name="Device/XMC1200_series/Source/ARM6/XMC1200x0200.sct"  version="1.0.0" attr="config" condition="XMC12xx_0200_ARMCC6LTO"/>
        <file category="linkerScript" name="Device/XMC1300_series/Source/ARM6/XMC1300x0008.sct"  version="1.0.0" attr="config" condition="XMC13xx_0008_ARMCC6LTO"/>
        <file category="linkerScript" name="Device/XMC1300_series/Source/ARM6/XMC1300x0016.sct"  version="1.0.0" attr="config" condition="XMC13xx_0016_ARMCC6LTO"/>
        <file category="linkerScript" name="Device/XMC1300_series/Source/ARM6/XMC1300x0032.sct"  version="1.0.0" attr="config" condition="XMC13xx_0032_ARMCC6LTO"/>
        <file category="linkerScript" name="Device/XMC1300_series/Source/ARM6/XMC1300x0064.sct"  version="1.0.0" attr="config" condition="XMC13xx_0064_ARMCC6LTO"/>
        <file category="linkerScript" name="Device/XMC1300_series/Source/ARM6/XMC1300x0128.sct"  version="1.0.0" attr="config" condition="XMC13xx_0128_ARMCC6LTO"/>
        <file category="linkerScript" name="Device/XMC1300_series/Source/ARM6/XMC1300x0200.sct"  version="1.0.0" attr="config" condition="XMC13xx_0200_ARMCC6LTO"/>
        <file category="linkerScript" name="Device/XMC1400_series/Source/ARM6/XMC1400x0032.sct"  version="1.0.0" attr="config" condition="XMC14xx_0032_ARMCC6LTO"/>
        <file category="linkerScript" name="Device/XMC1400_series/Source/ARM6/XMC1400x0064.sct"  version="1.0.0" attr="config" condition="XMC14xx_0064_ARMCC6LTO"/>
        <file category="linkerScript" name="Device/XMC1400_series/Source/ARM6/XMC1400x0128.sct"  version="1.0.0" attr="config" condition="XMC14xx_0128_ARMCC6LTO"/>
        <file category="linkerScript" name="Device/XMC1400_series/Source/ARM6/XMC1400x0200.sct"  version="1.0.0" attr="config" condition="XMC14xx_0200_ARMCC6LTO"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="RTE_Device" Cversion="1.1.0" condition="XMC1 CMSIS">
      <description>RTE Device</description>
      <RTE_Components_h>
        #define RTE_DEVICE
      </RTE_Components_h>  
      <files>
        <file category="include" name="RTE_Driver/"/>      
        <file category="header"  name="RTE_Driver/Config/XMC1100_T16/RTE_Device.h" version="1.1.0" condition="XMC1100_T16" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_T38/RTE_Device.h" version="1.1.0" condition="XMC1100_T38" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_Q24/RTE_Device.h" version="1.1.0" condition="XMC1100_Q24" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_Q40/RTE_Device.h" version="1.1.0" condition="XMC1100_Q40" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_T38/RTE_Device.h" version="1.1.0" condition="XMC1200_T38" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_T28/RTE_Device.h" version="1.1.0" condition="XMC1201_T28" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_T38/RTE_Device.h" version="1.1.0" condition="XMC1201_T38" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_Q40/RTE_Device.h" version="1.1.0" condition="XMC1201_Q40" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_T16/RTE_Device.h" version="1.1.0" condition="XMC1202_T16" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_T28/RTE_Device.h" version="1.1.0" condition="XMC1202_T28" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_Q24/RTE_Device.h" version="1.1.0" condition="XMC1202_Q24" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_Q40/RTE_Device.h" version="1.1.0" condition="XMC1202_Q40" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_T16/RTE_Device.h" version="1.1.0" condition="XMC1301_T16" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_T38/RTE_Device.h" version="1.1.0" condition="XMC1301_T38" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_Q24/RTE_Device.h" version="1.1.0" condition="XMC1301_Q24" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_Q40/RTE_Device.h" version="1.1.0" condition="XMC1301_Q40" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_T16/RTE_Device.h" version="1.1.0" condition="XMC1302_T16" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_T38/RTE_Device.h" version="1.1.0" condition="XMC1302_T38" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_Q24/RTE_Device.h" version="1.1.0" condition="XMC1302_Q24" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_Q40/RTE_Device.h" version="1.1.0" condition="XMC1302_Q40" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1400_Q48/RTE_Device.h" version="1.1.0" condition="XMC1401_Q48" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1400_Q64/RTE_Device.h" version="1.1.0" condition="XMC1401_F64" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1400_T38/RTE_Device.h" version="1.1.0" condition="XMC1402_T38" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1400_Q40/RTE_Device.h" version="1.1.0" condition="XMC1402_Q40" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1400_Q48/RTE_Device.h" version="1.1.0" condition="XMC1402_Q48" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1400_Q64/RTE_Device.h" version="1.1.0" condition="XMC1402_Q64" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1400_Q64/RTE_Device.h" version="1.1.0" condition="XMC1402_F64" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1403_Q40/RTE_Device.h" version="1.1.0" condition="XMC1403_Q40" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1403_Q48/RTE_Device.h" version="1.1.0" condition="XMC1403_Q48" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1403_Q64/RTE_Device.h" version="1.1.0" condition="XMC1403_Q64" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1403_Q48/RTE_Device.h" version="1.1.0" condition="XMC1404_Q48" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1403_Q64/RTE_Device.h" version="1.1.0" condition="XMC1404_Q64" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1403_Q64/RTE_Device.h" version="1.1.0" condition="XMC1404_F64" attr="config"/>
        </files>
    </component>
        
    <!-- START: Infineon Standard Peripherals Low Level Drivers -->
   
    <component Cclass="Device" Cgroup="XMClib" Csub="VADC" Cversion="2.1.24" condition="XMC1 CMSIS SCU">
      <description>Analog-to-digital converter (ADC) driver for XMC1x00</description>
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___v_a_d_c.html"/>      
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source"  name="Device/XMClib/src/xmc_common.c" />      
        <file category="source" name="Device/XMClib/src/xmc_vadc.c"/>
      </files>
    </component>

